app/controllers/courses_controller.rb

  def create
    @course = current_user.courses.build(course_params)
    @course.author = current_user.username
    #@course.punchline = current_user.punchline

    if @course.save
---
INSERT INTO "courses" ("title", "level", "author", "slug", "user_id", "created_at", "updated_at", "material_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @course.update(course_params)
---
UPDATE "courses" SET "material_id" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["material_id", 5], ["updated_at", "2020-10-17 11:31:49.150469"], ["id", 1]]

    def find_materials
      @materials = Material.all.order('created_at desc')
---
SELECT "materials".* FROM "materials" ORDER BY created_at desc