app/controllers/exercices_controller.rb

  def create
    @exercice = @course.exercices.build(exercice_params)
    @exercice.user_id = current_user.id
    @exercice.author = current_user.username
    @exercice.material = @course.materials


    if @exercice.save
---
INSERT INTO "exercices" ("title", "author", "course_id", "slug", "user_id", "created_at", "updated_at", "material") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"