app/controllers/home_controller.rb

SELECT "materials".* FROM "materials"
SELECT "courses".* FROM "courses" WHERE (material_id = 5)
SELECT "courses".* FROM "courses"
---
  def index
    if current_user.role == "student"
      @materials = Material.all
      #@materials = Material.where("cycle= ?", all AND "cycle= ?", current_user.cycle)
      @courses = Course.where("level= ?", current_user.level)
    else current_user.role == "teacher"
      @materials = Material.all
      @courses = Course.all