app/controllers/materials_controller.rb

  def index
    @materials = Material.all
---
SELECT "materials".* FROM "materials"

  def show
    @materials = Material.all#where(level= ?", current_user.level)
    @courses = Course.where('material_id = ?', @material.id)
---
SELECT "materials".* FROM "materials"
SELECT "courses".* FROM "courses" WHERE (material_id = 5)

  def create
    @material = current_user.materials.build(material_params)

    if @material.save
---
INSERT INTO "materials" ("title", "cycle", "slug", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Math"], ["cycle", "all"], ["slug", "math"], ["user_id", 1], ["created_at", "2020-10-16 17:30:47.480266"], ["updated_at", "2020-10-16 17:30:47.480266"]]

    def set_material
      @material = Material.friendly.find(params[:id])
---
SELECT "materials".* FROM "materials" WHERE "materials"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]